FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1756/LPC1756_USBDevice.c
    return length;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_SetStallState
 *-------------------------------------------------------------------------*
 * Description:
 *      Set the stall state of an endpoint
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint            -- Endpoint to set to stalled or not
 *                                     stalled.
 *      TBool                       -- ETrue for stall, else EFalse for
 *                                     not stalled.
 *-------------------------------------------------------------------------*/
static void NXP_LPC1756_USBDevice_SetStallState(
            void *aWorkspace,
            TUInt8 aEndpoint,
            TBool aStallState)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->SetStallState(
            p->iUSBDeviceController,
            aEndpoint,
            aStallState);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_IsStalled
 *-------------------------------------------------------------------------*
 * Description:
 *      Determine if an endpoint is stalled.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aEndpoint            -- Endpoint to check if stalled
 * Outputs:
 *      TBool                       -- ETrue if stalled, else EFalse
 *-------------------------------------------------------------------------*/
static TBool NXP_LPC1756_USBDevice_IsStalled(void *aWorkspace, TUInt8 aEndpoint)
{
    TBool result;

    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    result = (*p->iUSBDeviceController)->IsStalled(
            p->iUSBDeviceController,
            aEndpoint);
    UEZSemaphoreRelease(p->iSem);

    return result;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_EndpointInterruptsEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Allow an endpoint to generate interrupts.
 * Inputs:
 *      T_LPC1756_USBDev_Workspace *p -- workspace
 *      TUInt8 aEndpoint            -- Endpoint to trigger interrupts
 *-------------------------------------------------------------------------*/
static void NXP_LPC1756_USBDevice_EndpointInterruptsEnable(
                void *aWorkspace,
                TUInt8 aEndpoint)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->EndpointInterruptsEnable(
            p->iUSBDeviceController,
            aEndpoint);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_EndpointInterruptsDisable
 *-------------------------------------------------------------------------*
 * Description:
 *      Disallow an endpoint to generate interrupts.
 * Inputs:
 *      T_LPC1756_USBDev_Workspace *p -- workspace
 *      TUInt8 aEndpoint            -- Endpoint to trigger interrupts
 *-------------------------------------------------------------------------*/
static void NXP_LPC1756_USBDevice_EndpointInterruptsDisable(
                void *aWorkspace,
                TUInt8 aEndpoint)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->EndpointInterruptsDisable(
            p->iUSBDeviceController,
            aEndpoint);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_ForceAddressAndConfiguration
 *-------------------------------------------------------------------------*
 * Description:
 *      Force the USB to go to a given address and configuration.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      TUInt8 aAddress           -- Address of connection
 *      TUInt8 aConfigNum         -- Number of configuration to use
 *-------------------------------------------------------------------------*/
static void NXP_LPC1756_USBDevice_ForceAddressAndConfiguration(
            void *aWorkspace,
            TUInt8 aAddress,
            TUInt8 aConfigNum)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->ForceAddressAndConfigurationNum(
            p->iUSBDeviceController,
            aAddress,
            aConfigNum);
    UEZSemaphoreRelease(p->iSem);
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1756_USBDevice_Initialize
 *-------------------------------------------------------------------------*
 * Description:
 *      Initialize the hardware and all the endpoints.
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *-------------------------------------------------------------------------*/
static void NXP_LPC1756_USBDevice_Initialize(void *aWorkspace)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->Initialize(p->iUSBDeviceController);
    UEZSemaphoreRelease(p->iSem);
}

/*---------------------------------------------------------------------------*
 * Routine:  NXP_LPC1756_USBDevice_Configure
 *---------------------------------------------------------------------------*
 * Description:
 *      Configure and setup the USBDev screen with the given settings
 * Inputs:
 *      void *aWorkspace          -- USB Device's workspace
 *      T_USBDevSettings *aSettings -- Pointer to settings to use
 * Outputs:
 *      T_uezError                 -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError NXP_LPC1756_USBDevice_Configure(
        void *aWorkspace,
        const TUInt8 *aDescriptorTable)
{
    T_USBDevice_LPC1756_Workspace *p =
        (T_USBDevice_LPC1756_Workspace *)aWorkspace;
    T_USBDeviceControllerSettings settings;

    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    // Setup the descriptor table and usbdevice pointers
    settings.iUSBDescriptorTable = aDescriptorTable;
    settings.iUSBDevice = &p->iUSBDevice;

    (*p->iUSBDeviceController)->Configure(
            p->iUSBDeviceController,
            &settings);

